{
  "title": "Entiers Positifs en Binaire et Héxadécimal",
  "sections": [
    {
      "level": 2,
      "title": "Rappel : Les bases dans la vie courante",
      "content": "Notre système de notation repose sur une dispositon en colonnes.\nNous comptons avec 10 symboles allant de 0 à 9 que l'on nomme **chiffre**.\nUne fois que nous avons atteint le chiffre 9, si l'on souhaite rajouter 1, on se rend compte que l'on n'a pas de chiffres supérieurs.\nOn créée ainsi une colonne à gauche qui contiendra un chiffre allant de 1 à 9 en remettant le chiffre de la colonne originelle (ou les suivantes) à 0. \nPar exemple 426 est composé des chiffres 4, 2 et 6 représentés dans les colonnes des centaines, dizaines et unités."
    },
    {
      "level": 3,
      "title": "Les bases dans la vie courante",
      "content": "Notre quotidien est entouré de nombres, que ce soit pour les heures qui passent, les notes, le nombre d'oeufs dans une boite.\nIls sont partout et font partie de nos vies sans même que l'on s'en rende compte.\nMais il existe une quasi infinité de base !\n<br/>\nPar exemple, pour les oeufs nous avons souvent des douzaines d'oeufs, issue du fait qu'historiquement nous suivont le compte des oeufs avec le nombre de phalanges que l'on a sur une main (sans compter le pouce car celui ci pointe les phalanges pour compter).\n**Exemples**:\n* Les boites d'oeufs sont en base 12.\n* Les heures sont divisées en base 60.\n  En effet il était plus simple de diviser les heures en 60 minutes pour calculer les durées plus facilement. Cela provient des babyloniens qui comptaient dans un système sexagésinale.\n<br/>\nCertaines bases ont une représentation des chiffres particulière, qui sont alphanumériques.\n* Les Shadok comptent en base 4. Les personnages de ce dessin animé comptent avec 4 chiffres pour écrire leurs nombres : GA, BU, ZO, MEU.\n* Le système bibi-binaire est un système en base 16 conçu par le compositeur Boby Lafonte en 1968. Cet auteur aimait utiliser des calembours et a voulu créer son système bibi-binaire (comprenant système à bibi). Il est proposé d'utiliser des consonnes et des voyelles pour représenter les nombres : H, B, K, D et A, E, O, I.\nL'avantage, c'est que l'on peut *chanter les nombres*.\n* L'octal est une base contenant 8 symboles allant de 0 à 7.\n  Cette base servait aux informaticiens qui développaient en langage machine pour réduire le nombre de bits à écrire.\n  On l'écrit $B_{8} = \\lbrace 0,1,2,3,4,5,6,7 \\rbrace$"
    },
    {
      "level": 2,
      "title": "Définitions",
      "content": "Une base correspond au nombre de symboles qui permettent de représenter les chiffres ou les nombres.\nPour notre base décimale habituelle on écrit : $B_{10} = \\lbrace 0,1,2,...,9 \\rbrace$\nEn informatique, il a été décidé d'utiliser le binaire pour plusieurs raisons.\nLa principale est **le fait qu'une machine peut facilement détecter la différence entre deux état**. En effet, un processeur est composé de transistors qui traitent deux états : ouverts et fermés à la manière d'un interrupteur.\nLe binaire, ou représentation en base 2 est un moyen de représenter les nombres avec 2 symboles ici 0 ou 1.\nOn peut écrire $B_{2} = \\lbrace 0,1 \\rbrace$.\nOn nomme **bit** les chiffres de la représentation en base 2 et un ensemble de 8 bits est appellé un *byte* ou *octet*.\n*Question :*\n  *Combien de nombres peut-on représenter avec n bits ?*"
    },
    {
      "level": 2,
      "title": "Compter en base 2",
      "content": "Pour compter en base 2, on opère de la même manière. On a une colonne qui peut valoir 0 ou 1. Une fois que la colonne atteint 1, on rajoute une colonne à sa gauche à 1 et l'on passe la colonne de droite à 0."
    },
    {
      "level": 3,
      "title": "Comment passer de base 2 à base 10?",
      "content": "*Rappel : Compter en base 10*\n$154_{(10)} = 1\\times10^{2} + 5\\times10^{1} + 5\\times10^{0}$\nPour passer de la base 2 à la base 10, on réalise le même calcul en remplaçant la base 10 par la base 2 :\n$1101_{(2)} = 1\\times2^{3} + 1 \\times2^{2} + 0\\times2^{1} + 1 \\times2^{0} = 8 + 4 + 1 = 13_{(10)}$\nL'écriture ci-dessus n'est pas anodine. A partir de maintenant, pour écrire un nombre si la base n'est pas explicite, il faut la préciser. On peut l'écrire de plusieurs manières :\n* $154_{(10)}$ avec la base écrite sous le nombre en parenthèses.\n  <br/>\n* $\\overline{154}^{(10)}$ avec le nombre surligné et la base indiquée entre parenthèses.\n**Exercice** : Convertir les nombres de binaire en base décimale\n* $1101_{(2)}$\n* $1001_{(2)}$\n* $1010_{(2)}$\n* $1111_{(2)}$"
    },
    {
      "level": 4,
      "title": "Méthode des divisions successives",
      "content": "Pour passer de la base 10 à la base 2, on peut utiliser la méthode que l'on appelle *des divisions successives*.\nDe la même manière que l'on écrit en addition de puissances de bases (comme vu pour le rappel sur comment compter en base 10), on peut réaliser l'opération inverse pour trouver la représentation binaire.\n**Exemple**:\n<pre>\n29| 2\n  |---\n1 | 14 | 2\n       |---\n     0 | 7 | 2\n           |---\n         1 | 3 | 2\n               |---\n             1 | 1 | 2\n                   |---\n                 1 | 0\n</pre>\nOn divise successivement le nombre à convertir par 2. Chaque **reste** correspond au nombre dans la représentation et chaque **quotient** est à diviser à la suite par 2.\nOn repète ces opération jusqu'à ce que le quotient soit 0 et le reste 1.\nPour obtenir la représentation on part du reste le plus en bas qui représente le bit le plus à gauche (bit de poids fort) et on remonte pour obtenir le bit le plus à droite (bit de poids faible).\nPour 29 on obtient ainsi : $11101_{2} = 1\\times2^{4} + 1\\times2^{3} + 1\\times2^{2} + 1\\times2^{0} = 16 + 8 + 4 + 1 = 29_{10}$\n**Exercice**: Convertir les nombres en écriture décimale en binaire:\n* $27_{10}$\n* $14_{10}$\n* $42_{10}$\n* $33_{10}$"
    },
    {
      "level": 4,
      "title": "Méthode des soustractions successives",
      "content": "Une autre méthode utilisable est la méthode des soustractions successives.\nPour ce faire, il suffit de se munir d'un tableau de puissances de 2 et de savoir calculer toutes les puissances de 2 (une calculatrice peut aussi aider pour les puissances élevées).\n|$2^{n}$|$2^{n-1}$|$2^{n-2}$|...|$2^{2}$|$2^{1}$|$2^{0}$|\n|-------|---------|---------|---|-------|-------|-------|\n||||||||\nOn choisit la puissance de 2 supérieure au nombre à convertir et on regarde si on peut retirer chaque puissance de 2.\n**Exemple**: Convertir 42 en binaire\nOn choisit 64 > 42 donc on aura un tableau de 7 cases.\nEst-ce que 42 > 64 ? Non, on met 0 dans la case du tableau.\nEst-ce que 42 > 32 ? Oui, on met 1 dans la case du tableau. On opère maintenant sur le reste de la soustraction de 42 et 32.\nEst-ce que 10 > 16 ? Non, on met 0 dans le tableau.\nEt ainsi de suite jusqu'à avoir soit 0 au reste soit 1 qui correspond à la dernière case du tableau.\n| $2^{6} = 64$ | $2^{5}=32$ | $2^{4} = 16$ | $2^{3} = 8$ | $2^{2} = 4$ | $2^{1} = 2$ | $2^{0} = 1$ |\n|-------|---------|---------|---|-------|-------|-------|\n|0|1|0|1|0|1|0|\nOn peut aussi passer de binaire à décimal grâce à cette méthode, prenons en exemple $101110_{2}$.\n|$2^{6} = 64$|$2^{5}=32$|$2^{4} = 16$|$2^{3} = 8$|$2^{2} = 4$|$2^{1} = 2$|$2^{0} = 1$|\n|-------|---------|---------|---|-------|-------|-------|\n|0|1|0|1|0|1|0|\nIl suffit d'ajouter toutes les puissances de 2 où la case correspondante est à 1.\nIci on aurait : $2^{5} + 2^{2}  + 2^{1} = 42$, aussi facile que cela."
    },
    {
      "level": 2,
      "title": "Hexadécimal",
      "content": "En informatique, une autre base très importante est la base hexadécimale (ou *hex*). Cette base représente les nombres avec 16 symboles.\nCette base est très utile pour divers usages notamment :\n* La représentation d'adresse mémoire\n* La représentation des couleurs\nOn peut noter cette base $B_{16} = \\lbrace0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F\\rbrace$\nOn représente chaque symbole de la représentation en base hexadécimale par un ensemble de 4 bits. On peut donc dresser le tableau suivant :"
    },
    {
      "level": 5,
      "title": "Méthode des divisions successives",
      "content": "A l'instar de la base 2 (et de toutes les bases) pour convertir on peut utiliser la méthode des divisions successives comme développé pour la partie binaire mais en divisant successivement par 16."
    },
    {
      "level": 5,
      "title": "Passer par la base 2",
      "content": "Une autre méthode serait de convertir le nombre que nous avons en base 10 en binaire.\nAinsi, on regroupe par paquets de 4 bits en partant du bit de poids faible et en rajoutant des 0 si jamais le paquet le plus a droite contient moins de 4 bits.\nEnfin, on associe chaque paquet de 4 bits à son équivalent en base 16.\n**Exemple** : \nOn a $430_{10}$. On cherche sa représentation en base 2.\nOn obtient $1~1010~1110_{2}$.\nOn rajoute les 0 à gauche pour créer un paquet de 4 et on obtient : $000110101110_{2}$.\nEnfin, on associe les bits correspondants à leur représentation héxadécimale:\n$0001_{2} = 1_{16} ; 1010_{2} = A_{16} ; 1110_{2} = 4_{16}$\nOn en déduit alors que $0001~1010~1110_{2} \\Leftrightarrow 1AE_{16}$."
    },
    {
      "level": 5,
      "title": "Puissances de 16",
      "content": "On peut en connaissant les puissances de 16, réaliser les additions de puissances de 16 correspondant à chaque symbole du nombre écrit en héxadécimal.\nPour rendre ca compréhensible, on peut remplacer chaque symbole héxadécimal par sa représentation en base 10.\nAinsi ,en reprenant l'exemple précédent:\n$1_{16} = 1_{10};A_{16} = 10_{10};E_{16} = 14_{10}$\n$1AE_{16} = 1\\times 16^{2} + 10\\times 16^{1} + 14\\times 16^{0} = 256_{10} + 160_{10} + 14_{10} = 430_{10}$"
    }
  ],
  "metadata": {
    "level": "premiere",
    "chapter": "",
    "hasStyles": false,
    "cardTypes": []
  }
}