{
  "title": "On veut afficher les nombres de 1 à n choisi en faisant croître un entier i.",
  "sections": [
    {
      "level": 2,
      "title": "Qu'est ce qu'un programme ?",
      "content": "**Défintion:** On définit un **programme** comme étant une suite d'instruction élémentaires destinées à être exécutées par un ordinateur.\nLe langage python est un langage dit de haut niveau. Cela veut dire qu'il est plus proche de nous (utilisateurs) que de l'ordinateur (du processeur).\nCe langage est basé sur nos ordinateurs qui réalisent des instructions de manière séquentielle (c'est à dire réalisées les unes après les autres).\nOn peut dénombrer un certain nombre d'instructions élémentaires qui permettent de créer un programme.\nCes instructions élémentaires peuvent utiliser des opérateurs.\n**Définition:** Un opérateur est un caractère ou un ensemble de caractère qui correspond à une opération pouvant être réalisée par le processeur."
    },
    {
      "level": 2,
      "title": "Instanciation",
      "content": "L'instanciation est une instruction qui permet d'associer une **valeur** à une **variable**.\nUne variable en python est une chaîne de caractère que l'on associe à une **type** (domaine de valeurs).\nL'instanciation utilise l'opérateur `=`.\nPour la machine, cela revient à associer un espace mémoire à la valeur désignée.\nPar exemple :\n```python\na = 42\n#Instancier ma_chaine_de_caractere à la valeur 'Hello World!'\nma_chaine_de_caractere = 'Hello World!'\n```\nOn a donc ici, l'explicitation des types entiers ou chaînes de caractères mais il en existe un certain nombre : tableaux, listes, nombres réels (réels à virgule flottante) ou d'autres objets que l'on peut créer nous même.\nCette opération est la base de la programmation. On utilisera le terme **instancier** pour définir le fait d'associer à une variable une valeur donnée."
    },
    {
      "level": 2,
      "title": "Opérations mathématiques",
      "content": "Le langage python est un langage informatique. En informatique, il est nécessaire de réaliser des opérations qui peuvent être du domaine mathématique.\nIl existe un certain nombre d'opérations mathématiques qui sont associées à des opérateurs.\nOn peut citer :\n- $+$: addition\n- $-$: soustraction\n- $\\ast$: multiplication\n- $/$ : division\nCes opérateurs utilisent 2 valeurs, à l'instar de nos opérations que l'on peut écrire sur papier.\nIl en parait nécessaire d'instancier une variable à une opération, comme par exemple nos fonctions mathématiques $y = 3x+2$.\nPar exemple:\n```python\na = 3 + 2 \nb = 5 - 3\nc = a * b\nd = b / a\n```\nLes exemples précédents montrent que l'on peut réaliser des opérations sur les différentes variables que l'on a déjà créée.\nIl faut cependant prendre compte d'une chose importante : **le type des variables utilisées**.\nEn effet, les opérations **mathématiques** sont réservées à des variables de type entiers ou nombres réels. Il faut cependant faire attention aux nombres réels (flottants) à cause des imprécisions (cf cours précédent)."
    },
    {
      "level": 2,
      "title": "Opérations de comparaisons",
      "content": "Comme les opérations mathématiques, il est possible de réaliser des comparaisons sur des variables.\n!!! danger\n    **On ne peut comparer des éléments uniquement s'ils sont du même type** !  \n    Si jamais lors d'un programme on compare deux éléments de types différents, on pourrait faire face à ce que l'on appelle une erreur (**TypeError**).\nIl existe un certain nombre d'opérateurs en python qui permettent de réaliser des comparaisons.  \nOn peut citer :\n- $a > b$ : Cet opérateur correspond à une comparaison d'ordre (a plus grand que b).\n- $a < b$ : Cet opérateur correspond à une comparaison d'ordre (a plus petit que b).\n- $a >= b$ : Cet opérateur correspond à une comparaison d'ordre (a plus grand ou égal à b).\n- $a <= b$ : Cet opérateur correspond à une comparaison d'ordre (a plus petit ou égal à b).\n- $a == b$ : Cet opérateur correspond à une comparaison : a est égal à b.\n!!! Danger\n    Il ne faut pas confondre les opérateurs $=$ et $==$.  \n    En effet, $=$ ne sera utilisé uniquement lors d'**instanciation** de variables. Utiliser l'opérateur $=$ lors d'une **comparaison** peut mener à des erreurs! (**SyntaxError**)."
    },
    {
      "level": 2,
      "title": "Affichage et Demande à l'utilisateur",
      "content": "La fonction `print()` est utilisée pour afficher des informations à l’écran.  \nElle peut afficher des chaînes de caractères, des nombres, ou même les résultats de calculs.  \nOn peut également concaténer plusieurs éléments à afficher en les séparant par des virgules dans l’appel à print().  \nPar exemple, print(\"Bonjour\", \"le monde\", 42) affichera “Bonjour le monde 42” dans la console.\nD’un autre côté, la fonction input() permet de capturer des données saisies par l’utilisateur.  \nElle prend en argument une chaîne de caractères qui est affichée comme un message à l’utilisateur pour l’inviter à entrer une valeur.  \nLa valeur saisie par l’utilisateur est ensuite renvoyée sous forme de chaîne de caractères.  \nPar exemple, nom = input(\"Quel est votre nom ? \") demandera à l’utilisateur de saisir son nom, qui sera ensuite stocké dans la variable nom.  \n!!! Warning\n    Attention ! La fonction input permet de stocker l'entrée de l'utilisateur dans une variable mais celle-ci sera forcément du type `string`.\n    Si l'on souhaite traiter des nombres, il faudra alors modifier le type de la valeur à l'aide des fonctions le permettant."
    },
    {
      "level": 2,
      "title": "Conditions",
      "content": "Une condition est réalisable en python grâce à l'instruction `if`.\nCette condition permet d'évaluer des comparaisons, des états de variables ou des valeurs associées à des variables.\nSi cette condition est validée, alors le bout de code associé est exécuté, sinon il peut exister un bloc de code associé au mot-clef `else`.\nPar exemple, on souhaite réaliser un affichage suivant une valeur d'une variable âge qui correspond à l'âge de l'utilisateur qu'il renseigne.\n```python\nage = input('Quel est votre âge?')\nage_entier = int(age)\nif age_entier > 18 :\n    print('Vous êtes majeur')\nelse:\n    print('Vous êtes mineur')\n```\nCe bout de code permet d'afficher si l'utilisateur est majeur ou mineur.\nOn remarque la présence du bloc else.\nCependant, il existe un autre bloc permettant de réaliser des conditions si une condition n'est pas déjà validée. Ce bloc est le `elif`.\nPar exemple, on va réaliser un programme qui permet de mettre une appréciation à une note.\n```python\nnote = input('Quelle est la note à évaluer?')\nif note == 'A' :\n    print('Très bien')\nelif note == 'B':\n    print('Un peu plus pour exceller')\nelse:\n    print(\"Poursuis tes efforts\")\n```\n!!! Danger\n    On remaraque que l'on a un bloc elif. Celui-ci est exécuté si la première condition n'est pas validée et ainsi de suite. On peut enchaîner autant de bloc `elif` que nécessaire.\n    Cependant il faut faire attention au nombre de conditions réalisées car trop détailler peut ralentir la vitesse à laquelle on attend une réponse.\n    Chaque condition est évaluée jusqu'à trouver une qui est valide, ou rentrer dans le `else`.\n!!! Tip\n    Le bloc `else` n'est pas obligatoire s'il ne doit rien faire. On peut l'omettre\n    ```python\n    age = 36\n    if age < 40:\n        print(\"Vous êtes né après 1980\")\n    else:\n        print('')\n    ```\n    Ici, print('') ne sert pas à grand chose, on peut l'omettre.\n    ```python\n    age = 36\n    if age < 40 :\n        print('Vous êtes né après 1980')\n    ```"
    },
    {
      "level": 2,
      "title": "Boucles",
      "content": "Une boucle en python est la répétition d'une certaine partie d'un algorithme un certain nombre de fois ou suivant la validation d'une condition.\nIl existe plusieurs types de boucles en python."
    },
    {
      "level": 3,
      "title": "La boucle while",
      "content": "La boucle `while` correspond à une boucle qui s'exécute `tant que` la condition choisie est valide.\nPar exemple, on peut réaliser un bout de code tant qu'un nombre est positif, tant qu'un tableau n'est pas vide, tant qu'une chaîne de caractère n'est pas vide ou bien par exemple tant qu'une condition booléenne est valide.\nOn peut associer la syntaxe python suivante:\n```python\nn = 30\ni = 1\nwhile i <= n:\n    print(i)\n    i = i + 1\n```\nIci, ce bout de code incrémente 1 jusqu'à ce qu'il soit supérieur à n. Cela veut dire que la boucle va se dérouler tant que i est inférieur ou égal à n.\n!!! Danger\n    Une boucle `while` peut ne pas s'arrêter !\n    Il faut vérifier que la condition est valide jusqu'au point désiré. On parle de **terminaison de boucle**.\n    Par exemple, on peut réaliser une boucle infinie en écrivant `while True` ou bien en ayant une condition qui traite un entier positif et ne jamais le décrémenter."
    }
  ],
  "metadata": {
    "level": "premiere",
    "chapter": "",
    "hasStyles": false,
    "cardTypes": []
  }
}