{
  "title": "Web",
  "sections": [
    {
      "level": 2,
      "title": "Point Historique et Définitions",
      "content": "Le WEB a été créé en 1989 au CERN (institut de recherche Suisse) par une équipe chapeautée par **Tim Berners-Lee** et **Robert Cailliau**.\nLe but du projet initialement était la création d'une application qui permettrait l'échange de données sur Internet.\nLa technologie du WEB repose sur l'utilisation d'**hyperliens**. \nLes hyperliens sont des liens cliquables souvent bleus ressemblant à cela :\n[Lien menant à l'accueil du site](../../index.md)\nCes divers **hyperliens** permettent d'accéder à des données qui sont stockées sur des **serveurs**, comme des pages WEB, des images ou tout type de contenu.\nPour accéder aux différents serveurs, ces liens *\"pointent\"* vers les adresses IP correspondant aux différents serveurs qui détiennent ces ressources.\nPour accéder à toutes ces données, on utilise un **navigateur WEB**, un logiciel qui permet de traiter des demandes de données (appelées **requêtes**), les afficher ou réaliser certains traitement sur celles-ci.\n**Anecdote : voici la toute première page WEB, celle créée par les chercheurs du CERN :** [première page web](http://info.cern.ch/hypertext/WWW/TheProject.html)"
    },
    {
      "level": 2,
      "title": "Modèle Client - Serveur",
      "content": "On a vu précédemment dans les échanges TCP, que deux machines communiquaient : **emettrice et réceptrice.**\nOn appelle **client** une machine qui souhaite recevoir des informations ou des données. Cette machine correspond à la machine que l'on nommait *réceptrice*.\nOn appelle **serveur** une machine qui dispose d'informations ou de données et qui a pour rôle de les envoyer. Cette machine correspond à ce que l'on nommait *émettrice*.\nLors d'un échange entre un client et un serveur, ceux-ci émettent des échanges formalisés que l'on appelle **requête**.\nOn peut schématiser cela de cette manière : \n![client_serveur](client_serveur.png)"
    },
    {
      "level": 2,
      "title": "Adresse IP et URL",
      "content": "Il peut être fastidieux de retenir toutes les adresses IP de tous les sites que nous connaissons.\nPersonne n'écrit dans sa barre de recherche dans son navigateur **216.58.214.163** pour accéder à la page WEB associée : celle de *google.fr*\nOn appelle **URL** (**U**niform **R**essources **L**ocator) l'adresse d'un site WEB, adresse correspondante à l'adresse IP du serveur ou se retrouve la page mais dans des caractères intelligibles par l'être humain.\nUne **URL** est consituée de plusieurs parties séparées par des points:\n$\\overbrace{\\texttt{http(s)://}}^{\\texttt{protocole utilisé}}\\underbrace{\\texttt{www}}_{\\texttt{sous-domaine}}\\overbrace{\\texttt{google}}^{\\texttt{nom de domaine}}\\underbrace{\\texttt{com}}_{\\texttt{extension du domaine}}$\nLe serveur **DNS** (**D**omain **N**ame **S**erver) possède une table de correspondance entre l'adresse IP du serveur disposant des informations et d'une adresse dite **symbolique** que nous pouvons retenir plus facilement.\nPar exemple, nos navigateurs web possèdent des tables de ce style pour éviter de faire les mêmes requêtes tous les jours.\n|Site|Adresse symbolique|Adresse IP|\n|-|-|-|\n|Google|www.google.fr|172.217.20.163|\n|Youtube|www.youtube.fr|142.250.178.142|\n|Leboncoin|www.leboncoin.fr|18.164.52.43|\n|Amazon|www.amazon.fr|52.95.116.113|"
    },
    {
      "level": 2,
      "title": "Fonctionnement du serveur DNS",
      "content": "Le serveur DNS permet d'associer une adresse symbolique avec une adresse IP.\nPour obtenir l'adresse IP d'un serveur disposant d'une ressource que l'on cherche via une adresse symbolique, on peut distinguer plusieurs cas :"
    },
    {
      "level": 3,
      "title": "Adresse symbolique connue dans le navigateur",
      "content": "Si l'adresse symbolique est déjà stockée dans le cache du navigateur (ou du système d'exploitation), celui-ci remplace envoie la requête de recherche de la ressource avec l'adresse IP qu'il connait déjà dans sa table.\nPar exemple, si l'on cherche à aller sur le site www.google.fr, en dactylographiant notre adresse dans la barre de recherche, le navigateur va envoyer directement la requête de la page du site à l'adresse IP **172.217.20.163**."
    },
    {
      "level": 3,
      "title": "Adresse symbolique non connue dans le navigateur",
      "content": "Si l'adresse symbolique n'est pas connue par le navigateur (ou le système d'exploitation), divers requêtes sont réalisées à la suite pour trouver le bon serveur DNS qui dispose de l'adresse à chercher.\nCela va s'exécuter de manière **récursive**.\nAdmettons que nous cherchons le site **windows.microsoft.com**\n![dns](dns.png)"
    },
    {
      "level": 2,
      "title": "Le langage des pages WEB : HTML",
      "content": "Le **HTML** (HyperText Markup Language) a été créé en **1991** par **Tim Berners-Lee**, alors qu'il travaillait au **CERN**. C'est un langage dit \"**à balises**\".\nUn **langage à balises** est un type de langage informatique utilisé pour structurer et organiser des données en les entourant avec des **balises** ou **tags**.  \nLes balises sont des éléments de texte spécifiques, généralement entourés de crochets angulaires (`< >`), qui indiquent comment le contenu doit être interprété ou affiché.\nDans un langage à balises, chaque élément est délimité par une balise d’ouverture et une balise de fermeture.  \nPar exemple, dans **HTML**, la balise `<p>` marque le début d’un paragraphe, et la balise `</p>` marque sa fin :\n```html\n<p>Ceci est un paragraphe.</p>\n```\nLes balises ne sont pas visibles par l’utilisateur final, elles servent à structurer le document ou à fournir des **informations** sur la manière dont le contenu doit être rendu.  \nLes langages à balises sont souvent utilisés dans la **création de documents web** (comme HTML ou XML), car ils permettent d’ajouter une signification **sémantique** aux données et de contrôler la mise en forme ou le comportement du contenu."
    },
    {
      "level": 2,
      "title": "HTTP : protocole des requêtes sur le WEB",
      "content": "**HTTP** (HyperText Transfer Protocol) est un **protocole de communication** qui permet l'échange de données ou de pages sur le **WEB**.  \nIl fonctionne selon un modèle **client-serveur**, où un **client** (par exemple, un navigateur web) envoie une **requête** à un **serveur** pour accéder à une ressource, comme une page web.  \nCette requête inclut une méthode, comme **GET** (pour récupérer des données) ou **POST** (pour envoyer des données).  \nLe **serveur** répond avec un **code de statut** (comme **200 OK** si tout se passe bien) et la ressource demandée, qui peut être un fichier **HTML**, une image, ou un autre type de contenu."
    },
    {
      "level": 3,
      "title": "Les Méthodes HTTP",
      "content": "Lors d'une communication, le client utilise différentes méthodes pour interagir avec le serveur.\nLa **méthode GET** est utilisée pour récupérer des informations. Elle ne modifie aucune donnée sur le serveur et permet seulement d'obtenir des données comme des pages web, les fichiers necessaires à son affichage ou son fonctionnement etc...\n```\nGET /utilisateurs/profil?id=123 HTTP/1.1\nHost: www.reseausocial.com\nUser-Agent: Mozilla/5.0\nAccept-Language: fr-FR\n```\nLa **méthode POST** est utilisée pour envoyer des données au serveur pour en modifier certaines ressources (informations d'un compte par exemple, envoi de fichiers etc...).\n```\nPOST /utilisateurs/inscription HTTP/1.1\nHost: www.reseausocial.com\nContent-Type: application/x-www-form-urlencoded\nContent-Length: 54\nnom=Dupont&prenom=Jean&email=jean.dupont@email.com\n```\nCes méthodes sont souvent utilisées lors de l'envoi de formulaires ou d'initialisation de la page par le navigateur.\nAprès chaque requête, le serveur renvoie un code de statut qui indique le résultat du traitement :\n200 OK : La requête a réussi\n404 Not Found : La ressource demandée n'existe pas\n500 Internal Server Error : Problème côté serveur"
    }
  ],
  "metadata": {
    "level": "seconde",
    "chapter": "II_-_Web",
    "hasStyles": false,
    "cardTypes": [],
    "sourceFile": "II_-_Web/Cours.md"
  }
}