{
  "title": "Internet",
  "sections": [
    {
      "level": 2,
      "title": "Point historique",
      "content": "La création d'Internet date du début des années 1960. L'idée était de relier divers machines pour envoyer des données, à l'origine des travaux issus de laboratoires ou des universités.\nA l'époque, le projet initial s'appelait ARPANET et était un projet détenu par la Défense des États-Unis chapeauté Robert Kahn à la Defense Advanced Research Projects Agency.\nLe premier objectif était de relier les universités de Stanford, de Los Angeles et celle de l'Utah.\nCe n'est que le 20 septembre 1969 que la première communication voit le jour entre l'université de Californie et celle de Stanford.\nLe premier message transmis de l'Histoire était *login*.\n![arpa](img/arpanet.jpeg)\nÀ la suite de cela, dans les années 70-80, des normalismes de communication ont vu le jour. On appelle cet ensemble de règles à respecter des **protocoles**.\nLa manière de communiquer pour les machines est découpées en diverses étapes.\nCes diverses étapes sont catégorisées dans un modèle : le modèle TCP-IP qui explique chaque étape de la communication.\nChaque étape (ou couche) du modèle TCP-IP correspond à divers protocoles.\nDans les années 1980, le fameux **protocole TCP/IPv4** a vu le jour. Il est installé en 1983 sur ARPANET, la même année où ont vu le jour les règles des systèmes de nom de domaine (DNS).\nLes années 1990 ont permis de faire voir le jour à une des plus grandes technologies jamais créée par l'être humain : le WEB, créé au CERN (en Suisse) par Tim Berners-Lee et Robert Cailliau.\n![tblrc](img/tblrc.jpeg)\nDepuis, Internet permet de relier plus de 3 à 4 milliards d'internautes pour s'envoyer des mails, des fichiers ou accéder à une quantité de données incommensurable à l'aide de plusieurs applications dépendant de protocoles.\nPar exemple, il existe des applications de mail (protocole POP), d'échange de fichier (FTP) ou de navigation sur des pages (WEB).\n![map](img/geo-mercator.svg)\nEn clair, **Internet est un réseau informatique à échelle mondiale sur lequel de nombreuses applications sont basées.**"
    },
    {
      "level": 3,
      "title": "Définitions",
      "content": "Un **réseau informatique** est un ensemble de machines reliées, par différents moyens, qui communiquent entre elles pour échanger des données ou des informations.\nOn retrouve un certain nombre d'éléments sur un réseau informatique qui ont chacun leur propre rôle."
    },
    {
      "level": 3,
      "title": "Les éléments d'un réseau",
      "content": "Pour qu'un réseau fonctionne, il faut des éléments le constituant.\nOn retrouve :\n| élément  | rôle                                                               | exemple                                      |\n|----------|--------------------------------------------------------------------|----------------------------------------------|\n| Machines | Élément qui cherche à communiquer, envoyer ou recevoir des données | ordinateur, tablettes, consoles, smartphones |\n| Switch   | Élément qui relie de manière locale des machines                   | box internet, switch RJ45                    |\n| Routeur  | Élément qui permet de relier un réseau local à Internet ou d'autres réseaux | Box internet, routeur spécifique    |\n| Cables, Ondes | Élément qui permet de relier les diverses machines au Switch ou au routeur| Câble Ethernet, Fibre optique, WiFi|\nOn a défini dans les rôles divers types de réseaux.\nOn parle de réseau **local** lorsque dans un réseau, divers machines peuvent communiquer directement entre elles sans passer par d'autres réseaux. Exemple : un réseau domestique.\nOn peut représenter cela de cette manière :\n![rlinternet](img/rlinternet.png)\nOn dispose de machines, d'un réseau mais, comment se retrouvent-elles pour communiquer? Quelles techniques sont utilisées?"
    },
    {
      "level": 3,
      "title": "Adressage de machines sur un réseau local",
      "content": "Une machine dispose d'une ou plusieurs **cartes réseaux**. Ces cartes permettent de communiquer de manière locale ou de manière globale vers Internet.\nCes cartes disposent de plusieurs adresses qui permettent de l'identifier sur un réseau.\nDe manière locale, une carte réseau dispose d'une adresse **MAC (Media Access Control)**.\nCette adresse MAC peut aussi être appelée **adresse physique** car elle correspond à l'adresse utilisée par le port Ethernet et le protocole Ethernet.\nCette adresse est composée de 6 blocs de 2 caractères hexadécimaux. `Exemple : a1:b2:c3:d4:e5:f6`.\nLa base hexadécimale correspond à une représentation en 16 caractères de chiffres ou de nombres.\n**Rédiger le tableau de conversion hexadécimal - décimal**."
    },
    {
      "level": 3,
      "title": "Adressage de machines sur Internet",
      "content": "Chaque réseau doit pouvoir être accessible et reconnaissable.\nSur Internet, on utilise ce que l'on appelle **l'Adresse IP** (pour Internet Protocole).\nUne adresse IP est constituée de 4 nombres allant de 0 à 255 représenté en binaire.\nLe binaire correspond à une représentation en 2 caractères de chiffres ou de nombres (0 et 1).\nPar exemple : 127.0.0.1 est une adresse IP écrite en base 10, compréhensible par l'humain mais pas par l'ordinateur.\nIl faut pouvoir convertir ces nombres en représentation **décimale** en **binaire**.\n**Voir partie binaire.**\nL'adresse IP est constituée de 2 parties :\n* La partie Réseau : elle permet d'identifier un réseau sur Internet.\n* La partie Machine : elle permet d'identifier une machine sur le réseau défini.\nPour connaître ces deux parties, on utilise ce que l'on appelle un **masque**.\nIl permet de définir la répartition du nombre de bits pour la partie Réseau. On pourra en déduire le nombre de bits réservés pour la partie Machine. On peut le représenter de diverses manières :\n_______________________________________________________________________________________\n_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\n______________________________________________________________________________________________________________________________________________________________________________\n**Exemple :** \nOn dispose de l'adresse **128.40.94.3** qui dispose d'un masque de 16 bits.  \nCela correspond en binaire à $10000000.00101000.01011110.00000100_2$.  \nCela veut dire que le masque est $11111111.11111111.00000000.00000000_2$.  \nOn peut donc définir que l'adresse du serveur est **128.40.0.0** et que cette adresse correspond à la machine **94.3** de ce réseau.\n!!! Warning\n    L'adresse réseau est très importante car deux machines sont dans le même réseau si elles ont la même adresse réseau."
    },
    {
      "level": 2,
      "title": "La communication entre deux machines",
      "content": "On sait comment les machines se reconnaissent sur Internet (quelle sont les adresses) mais on veut savoir surtout comment des données transitent sur Internet pour aller d'une machine à une autre.\nPour échanger des données, on ne peut pas les envoyer de but en blanc. En effet, les données sont trop volumineuses pour être envoyées d'un coup, il faut les découper. On appelle **paquet** une découpe d'une donnée qui doit être échangée entre deux machines.\nLe protocole TCP-IP permet la communication et l'échange de données sur Internet entre une machine **émettrice** et une **réceptrice**.\nCe protocole est composé de deux protocoles :\n* Le protocole TCP permet le contrôle et la sécurité de l'envoi des paquets. Il permet d'être sur qu'un paquet est arrivé à destination à l'aide **d'accusés de réceptions**.\n* Le protocole IP qui permet d'identifier quelles machines sur quels réseaux communiquent à l'aide de l'adresse IP.\nLe protocole TCP-IP fonctionne en plusieurs étapes :\n1. Le protocole découpe la donnée à échanger en plusieurs paquets composés de 0 et de 1 d'une certaine taille donnée et numérotés.\n2. La donnée transite pour partir de la machine de départ à la machine de destination.\n3. Tous les paquets sont reconstruits à l'aide de leur numérotation.\n4. Enfin, un contrôle est réalisé par la machine de réception pour s'assurer que la donnée est bien **intègre**, c'est à dire que la donnée est bien correcte. Si la donnée n'est pas correcte, la machine de reception demande de renvoyer les paquets \"défectueux\"."
    }
  ],
  "metadata": {
    "level": "seconde",
    "chapter": "I_-_Internet",
    "hasStyles": false,
    "cardTypes": [],
    "sourceFile": "I_-_Internet/Cours.md"
  }
}